app/views/tickets/edit.html.erb

  <label>Assigner à</label>
  <%= f.select :personne_id, Personne.all.collect { |p| [ p.nom, p.id ] }, include_blank: true %>
---
SELECT "personnes".* FROM "personnes"