app/views/tickets/new.html.erb

  <label>Assigner à:</label><br/>
  <%= f.select :personne_id, Personne.all.collect { |p| [ p.nom, p.id ] }, include_blank: true %><br />
---
SELECT "personnes".* FROM "personnes"