app/controllers/tickets_controller.rb

    def show
     @ticket=Ticket.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
     @ticket=Ticket.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
     @ticket=Ticket.find(params[:id])
     @ticket.update(tickets_params)
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tickets" SET "titre" = $1, "statut" = $2, "updated_at" = $3 WHERE "tickets"."id" = $4  [["titre", "ticket1"], ["statut", "A faire"], ["updated_at", "2022-04-27 13:05:01.025171"], ["id", 4]]

    def create
      ticket=Ticket.create(tickets_params)
---
INSERT INTO "tickets" ("titre", "created_at", "updated_at", "personne_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titre", "shshh"], ["created_at", "2022-04-27 14:18:13.518440"], ["updated_at", "2022-04-27 14:18:13.518440"], ["personne_id", 1]]

    def destroy
    @ticket=Ticket.find(params[:id])
    @ticket.destroy
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 2]]